from textinput import MyTextInput

class NormalInput(MyTextInput):
    def __init__(self, **kwargs):
        super().__init__(**kwargs)
        self.text = "अस्माकं  देशः भारतदेशः। एषः  देशः विश्वस्य विशालः गणतन्त्रदेशः  वर्तते।\nभारतदेशस्य  उत्तरदिशि  हिमालयः  नाम  उत्तुङ्गतमः  पर्वतः अस्ति। दक्षिणदिशि श्रीलङ्कादेशः वर्तते। \nपश्चिमदिशि  अफगाणिस्तानदेशः तथा  पूर्वदिशि बर्मा, नेपालः चीनः च  वर्तन्ते। \nगङ्गा, यमुना, ब्रह्मपुत्रा, कृष्णा, कावेरी, गोदावरी नर्मदा च भारतदेशस्य नद्यः। \nभारतदेशः धार्मिकः तथा देवभूमिः  नाम्ना प्रसिद्धः।  केदारनाथः, बद्रीनाथः, काशी, मथुरा, सुवर्णमन्दिरः, वैष्णोदेवी   इत्यादयः धार्मिकस्थलाः प्रसिध्दाः। \nवेदाः, रामायणम्, महाभारतम्, पुराणानि इत्यादी अस्माकं प्राचीनग्रन्थाः सन्ति। अस्माकं देशे विविधाः भाषाः, विविधाः वेशाः विविधाः धर्माः  च। तथापि अस्माकम् एका एव राष्ट्रीयता। वयं  सर्वे भारतीयाः। \nभारतदेशस्य उत्कर्षः अस्माकं धर्मः। वन्दे भारतम्। वन्दे मातरम्।"
        self.font_size = "25sp"
        self.font_name = "Aparajita.ttf"
        self.forground_color = (1,0,1,1)
